
سامبوڠ = رينتيتن.join
ڤيسه = رينتيتن.split
ݢنتي = رينتيتن.replace

حروف = {
    'ا' : [[] ,-1 ,-1 ,[]],
    'ب' : [[] ,[] ,[] ,[]],
    'ت' : [[] ,[] ,[] ,[]],
    'ة' : [[] ,-1 ,-1 ,[]],
    'ث' : [[] ,[] ,[] ,[]],
    'ج' : [[] ,[] ,[] ,[]],
    'چ' : [[] ,[] ,[] ,[]],
    'ح' : [[] ,[] ,[] ,[]],
    'خ' : [[] ,[] ,[] ,[]],
    'د' : [[] ,-1 ,-1 ,[]],
    'ذ' : [[] ,-1 ,-1 ,[]],
    'ر' : [[] ,-1 ,-1 ,[]],
    'ز' : [[] ,-1 ,-1 ,[]],
    'س' : [[] ,[] ,[] ,[]],
    'ش' : [[] ,[] ,[] ,[]],
    'ص' : [[] ,[] ,[] ,[]],
    'ض' : [[] ,[] ,[] ,[]],
    'ط' : [[] ,[] ,[] ,[]],
    'ظ' : [[] ,[] ,[] ,[]],
    'ع' : [[] ,[] ,[] ,[]],
    'غ' : [[] ,[] ,[] ,[]],
    'ڠ' : [[] ,[] ,[] ,[]],
    'ف' : [[] ,[] ,[] ,[]],
    'ڤ' : [[] ,[] ,[] ,[]],
    'ق' : [[] ,[] ,[] ,[]],
    'ک' : [[] ,[] ,[] ,[]],
    'ݢ' : [[] ,[] ,[] ,[]],
    'ل' : [[] ,[] ,[] ,[]],
    'م' : [[] ,[] ,[] ,[]],
    'ن' : [[] ,[] ,[] ,[]],
    'و' : [[] ,-1 ,-1 ,[]],
    'ۏ' : [[] ,-1 ,-1 ,[]],
    'ه' : [[] ,[] ,[] ,[]],
    'ء' : [[] ,-1 ,-1 ,[]],
    'ي' : [[] ,[] ,[] ,[]],
    'ى' : [[] ,[] ,[] ,[]],
    'ڽ' : [[] ,[] ,[] ,[]],
    'لا' : [[] ,-1 ,-1 ,[]],
    'ايکسترا' : [[] ,[] ,-1 ,-1], # untuk panjangkan س ش ص ض ڤ ف
    'أ' : [[] ,-1 ,-1 ,[]],
    'إ' : [[] ,-1 ,-1 ,[]],
    'ـ' : [[] ,-1 ,-1 ,-1],
    '،' : [[] ,-1 ,-1 ,-1],
    '؛' : [[] ,-1 ,-1 ,-1],
    '؟' : [[] ,-1 ,-1 ,-1],
    '٢' : [[] ,-1 ,-1 ,-1],
}
ابجد = ڤيسه('ا|ب|ت|ة|ث|ج|چ|ح|خ|د|ذ|ر|ز|س|ش|ص|ض|ط|ظ|ع|غ|ڠ|ف|ڤ|ق|ک|ݢ|ل|م|ن|و|ۏ|ه|ء|ي|ى|ڽ|لا|ايکسترا|أ|إ|ـ|،|؛|؟|٢' ,'|')

تندا_باچ = سناراي('ـ،؛؟')
رودا = ڤيسه('ر،ز،و،ۏ،د،ذ،ا،أ،إ،ء،ة،لا' ,'،')


فوڠسي داڤت_اي_دي(ح ,ي=0):
    اي_دي = 0x66 # سلڤس "?" ترباليق
    اونتوق اکسارا دالم ابجد:
        جک اکسارا == ح:
            جک اکسارا دالم تندا_باچ: # ايســــتيميوا
                کمبالي ['{symbol:%.2x}' % اي_دي]
            جکاءين اکسارا دالم 'فڤ' دان ي دالم [0 ,3]:
                کمبالي ['{symbol:%.2x}' % (اي_دي + ي) ,داڤت_اي_دي('ايکسترا' ,0)[0]]
            جکاءين اکسارا دالم 'سشصض' دان ي دالم [0 ,3]:
                کمبالي ['{symbol:%.2x}' % (اي_دي + ي) ,داڤت_اي_دي('ايکسترا' ,1)[0]]
            لاءين:
                کمبالي ['{symbol:%.2x}' % (اي_دي + ي)]
        لاءين:
            اي_دي += حروف[اکسارا].count([])
    چيتق('RALAT: ' ,ح ,ي)
    کمبالي  ['|RA %s L %d AT|' % (ح ,ي)]



فوڠسي توکر(ڤرکاتاءن):
    رينتيتن_اخير = []
    اونتوق ي ,ک دالم مڠڠکاکن(ڤرکاتاءن):

        جک ک == 'ا' دان ي != 0 دان ڤرکاتاءن[ي-1] == 'ل':
                لنجوت
        جکاءين ک == '\u200c':
            لنجوت
        جکاءين ک بوکن دالم حروف:
            کمبالي [ک]


        جک ي == 0:
            جک len(ڤرکاتاءن) == 1:
                جک ک دالم رودا:
                    کمبالي داڤت_اي_دي(ک ,1) # tunggal
                لاءين:
                    کمبالي داڤت_اي_دي(ک ,3) # tunggal
            لاءين:
                جک ڤرکاتاءن[ي+1] == '\u200c':
                    جک ک دالم رودا:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tunggal
                    لاءين:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,3) # tunggal
                جکاءين ک == 'ل' دان ڤرکاتاءن[ي+1] == 'ا':
                    رينتيتن_اخير += داڤت_اي_دي('لا' ,1)
                جکاءين ک دالم رودا:
                    رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tunggal
                لاءين:
                    رينتيتن_اخير += داڤت_اي_دي(ک ,2) # awal kata


        جکاءين ي == len(ڤرکاتاءن) - 1:
            جک ڤرکاتاءن[ي-1] == '\u200c' اتاو ڤرکاتاءن[ي-1] دالم رودا:
                جک ک دالم رودا:
                    رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tunggal
                لاءين:
                    رينتيتن_اخير += داڤت_اي_دي(ک ,3) # tunggal
            لاءين:
                رينتيتن_اخير += داڤت_اي_دي(ک ,0) # akhir kata
            کمبالي رينتيتن_اخير


        لاءين:
            جک ڤرکاتاءن[ي+1] == '\u200c':
                جک ڤرکاتاءن[ي-1] == '\u200c' اتاو ڤرکاتاءن[ي-1] دالم رودا:
                    جک ک == 'ل' دان ڤرکاتاءن[ي+1] == 'ا':
                        رينتيتن_اخير += داڤت_اي_دي('لا' ,1) # tunggal
                    جکاءين ک دالم رودا:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tunggal
                    لاءين:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,3) # tunggal
                لاءين:
                    جک ک == 'ل' دان ڤرکاتاءن[ي+1] == 'ا':
                        رينتيتن_اخير += داڤت_اي_دي('لا' ,0) # akhir kata
                    جکاءين ک دالم رودا:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,0) # akhir kata
                    لاءين:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,0) # akhir kata

            لاءين:
                جک ڤرکاتاءن[ي-1] == '\u200c' اتاو ڤرکاتاءن[ي-1] دالم رودا:
                    جک ک == 'ل' دان ڤرکاتاءن[ي+1] == 'ا':
                        رينتيتن_اخير += داڤت_اي_دي('لا' ,1) # tunggal
                    جکاءين ک دالم رودا:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tunggal
                    لاءين:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,2) # awal kata
                لاءين:
                    جک ک == 'ل' دان ڤرکاتاءن[ي+1] == 'ا':
                        رينتيتن_اخير += داڤت_اي_دي('لا' ,0) # tunggal
                    جکاءين ک دالم رودا:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,0) # akhir kata
                    لاءين:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tengah kata

    کمبالي رينتيتن_اخير

tukar = توکر










#
