sambung = str.join

سامبوڠ = رينتيتن.join
ڤيسه = رينتيتن.split
ݢنتي = رينتيتن.replace

اکسارا_ڤرتام = 0x66

ڤنجڠ_نام = 15

حروف = {
    'ا' : [[] ,-1 ,-1 ,[]],
    'ب' : [[] ,[] ,[] ,[]],
    'ت' : [[] ,[] ,[] ,[]],
    'ة' : [[] ,-1 ,-1 ,[]],
    'ث' : [[] ,[] ,[] ,[]],
    'ج' : [[] ,[] ,[] ,[]],
    'چ' : [[] ,[] ,[] ,[]],
    'ح' : [[] ,[] ,[] ,[]],
    'خ' : [[] ,[] ,[] ,[]],
    'د' : [[] ,-1 ,-1 ,[]],
    'ذ' : [[] ,-1 ,-1 ,[]],
    'ر' : [[] ,-1 ,-1 ,[]],
    'ز' : [[] ,-1 ,-1 ,[]],
    'س' : [[] ,[] ,[] ,[]],
    'ش' : [[] ,[] ,[] ,[]],
    'ص' : [[] ,[] ,[] ,[]],
    'ض' : [[] ,[] ,[] ,[]],
    'ط' : [[] ,[] ,[] ,[]],
    'ظ' : [[] ,[] ,[] ,[]],
    'ع' : [[] ,[] ,[] ,[]],
    'غ' : [[] ,[] ,[] ,[]],
    'ڠ' : [[] ,[] ,[] ,[]],
    'ف' : [[] ,[] ,[] ,[]],
    'ڤ' : [[] ,[] ,[] ,[]],
    'ق' : [[] ,[] ,[] ,[]],
    'ک' : [[] ,[] ,[] ,[]],
    'ݢ' : [[] ,[] ,[] ,[]],
    'ل' : [[] ,[] ,[] ,[]],
    'م' : [[] ,[] ,[] ,[]],
    'ن' : [[] ,[] ,[] ,[]],
    'و' : [[] ,-1 ,-1 ,[]],
    'ۏ' : [[] ,-1 ,-1 ,[]],
    'ه' : [[] ,[] ,[] ,[]],
    'ء' : [[] ,-1 ,-1 ,[]],
    'ي' : [[] ,[] ,[] ,[]],
    'ى' : [[] ,[] ,[] ,[]],
    'ڽ' : [[] ,[] ,[] ,[]],
    'لا' : [[] ,-1 ,-1 ,[]],
    'ئ' : [[] ,[] ,[] ,[]],
    'ايکسترا' : [[] ,[] ,-1 ,-1],
    'أ' : [[] ,-1 ,-1 ,[]],
    'إ' : [[] ,-1 ,-1 ,[]],
    'ـ' : [[] ,-1 ,-1 ,-1],
    '،' : [[] ,-1 ,-1 ,-1],
    '؛' : [[] ,-1 ,-1 ,-1],
    '؟' : [[] ,-1 ,-1 ,-1],
    '٢' : [[] ,-1 ,-1 ,-1],
    '-' : [[] ,-1 ,-1 ,-1],
    'رواڠ' : [[] ,[] ,-1 ,-1],

}
ابجد = ڤيسه('ا|ب|ت|ة|ث|ج|چ|ح|خ|د|ذ|ر|ز|س|ش|ص|ض|ط|ظ|ع|غ|ڠ|ف|ڤ|ق|ک|ݢ|ل|م|ن|و|ۏ|ه|ء|ي|ى|ڽ|لا|ئ|ايکسترا|أ|إ|ـ|،|؛|؟|٢|-|رواڠ' ,'|')

تندا_باچ = سناراي('ـ،؛؟-٢')
رودا = ڤيسه('ر،ز،و،ۏ،د،ذ،ا،أ،إ،ء،ة،لا' ,'،')
جاڠن_سامبوڠ = ['\u200c' ,'٢' ,'-']

فوڠسي داڤت_اي_دي(ح ,ي=0):
    اي_دي = اکسارا_ڤرتام # سلڤس "?" ترباليق
    اونتوق اکسارا دالم ابجد:
        جک اکسارا == ح:
            جک اکسارا دالم تندا_باچ: # ايســــتيميوا
                کمبالي ['{symbol:%.2x}' % اي_دي]
            جکاءين اکسارا دالم 'فڤ' دان ي دالم [0 ,3]:
                کمبالي ['{symbol:%.2x}' % (اي_دي + ي) ,داڤت_اي_دي('ايکسترا' ,0)[0]]
            جکاءين اکسارا دالم 'سشصض' دان ي دالم [0 ,3]:
                کمبالي ['{symbol:%.2x}' % (اي_دي + ي) ,داڤت_اي_دي('ايکسترا' ,1)[0]]
            لاءين:
                کمبالي ['{symbol:%.2x}' % (اي_دي + ي)]
        لاءين:
            اي_دي += حروف[اکسارا].count([])
    #چيتق('RALAT: ' ,ح ,ي)
    کمبالي  [ح]



فوڠسي توکر(ڤرکاتاءن):
    رينتيتن_اخير = []
    اونتوق ي ,ک دالم مڠڠکاکن(ڤرکاتاءن):

        جک ک == 'ا' دان ي != 0 دان ڤرکاتاءن[ي-1] == 'ل':
                لنجوت
        جکاءين ک == '\u200c':
            لنجوت
        جکاءين ک بوکن دالم حروف:
            رينتيتن_اخير += [ک]


        جکاءين ي == 0:
            جک len(ڤرکاتاءن) == 1:
                جک ک دالم رودا:
                    کمبالي داڤت_اي_دي(ک ,1) # tunggal
                لاءين:
                    کمبالي داڤت_اي_دي(ک ,3) # tunggal
            لاءين:
                جک ڤرکاتاءن[ي+1] دالم جاڠن_سامبوڠ:
                    جک ک دالم رودا:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tunggal
                    لاءين:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,3) # tunggal
                جکاءين ک == 'ل' دان ڤرکاتاءن[ي+1] == 'ا':
                    رينتيتن_اخير += داڤت_اي_دي('لا' ,1)
                جکاءين ک دالم رودا:
                    رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tunggal
                لاءين:
                    رينتيتن_اخير += داڤت_اي_دي(ک ,2) # awal kata


        جکاءين ي == len(ڤرکاتاءن) - 1:
            جک ڤرکاتاءن[ي-1] دالم جاڠن_سامبوڠ اتاو ڤرکاتاءن[ي-1] دالم رودا:
                جک ک دالم رودا:
                    رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tunggal
                لاءين:
                    رينتيتن_اخير += داڤت_اي_دي(ک ,3) # tunggal
            لاءين:
                رينتيتن_اخير += داڤت_اي_دي(ک ,0) # akhir kata
            کمبالي رينتيتن_اخير


        لاءين:
            جک ڤرکاتاءن[ي+1] دالم جاڠن_سامبوڠ:
                جک ڤرکاتاءن[ي-1] دالم جاڠن_سامبوڠ اتاو ڤرکاتاءن[ي-1] دالم رودا:
                    جک ک == 'ل' دان ڤرکاتاءن[ي+1] == 'ا':
                        رينتيتن_اخير += داڤت_اي_دي('لا' ,1) # tunggal
                    جکاءين ک دالم رودا:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tunggal
                    لاءين:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,3) # tunggal
                لاءين:
                    جک ک == 'ل' دان ڤرکاتاءن[ي+1] == 'ا':
                        رينتيتن_اخير += داڤت_اي_دي('لا' ,0) # akhir kata
                    جکاءين ک دالم رودا:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,0) # akhir kata
                    لاءين:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,0) # akhir kata

            لاءين:
                جک ڤرکاتاءن[ي-1] دالم جاڠن_سامبوڠ اتاو ڤرکاتاءن[ي-1] دالم رودا:
                    جک ک == 'ل' دان ڤرکاتاءن[ي+1] == 'ا':
                        رينتيتن_اخير += داڤت_اي_دي('لا' ,1) # tunggal
                    جکاءين ک دالم رودا:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tunggal
                    لاءين:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,2) # awal kata
                لاءين:
                    جک ک == 'ل' دان ڤرکاتاءن[ي+1] == 'ا':
                        رينتيتن_اخير += داڤت_اي_دي('لا' ,0) # tunggal
                    جکاءين ک دالم رودا:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,0) # akhir kata
                    لاءين:
                        رينتيتن_اخير += داڤت_اي_دي(ک ,1) # tengah kata

    کمبالي رينتيتن_اخير



فوڠسي کيرا_رواڠ(ح ,ي=0):
    جدوال = ڤيسه('''ا	0	ffff0f00
ا	1	00ffffff
ب	0	00000000
ب	1	ff0000ff
ب	2	ff00f0ff
ب	3	000000f0
ت	0	00000000
ت	1	0f0000ff
ت	2	ff0000ff
ت	3	000000f0
ة	0	ff000000
ة	1	000000ff
ث	0	00000000
ث	1	0f0000ff
ث	2	ff0000ff
ث	3	000000f0
ج	0	00000000
ج	1	00000000
ج	2	000000f0
ج	3	000000f0
چ	0	00000000
چ	1	00000000
چ	2	000000f0
چ	3	000000f0
ح	0	00000000
ح	1	00000000
ح	2	000000f0
ح	3	000000f0
خ	0	00000000
خ	1	00000000
خ	2	000000f0
خ	3	000000f0
د	0	ff000000
د	1	0f0000ff
ذ	0	ff000000
ذ	1	0f0000ff
ر	0	ff0f0000
ر	1	ff0000ff
ز	0	ff0f0000
ز	1	ff0000ff
س	0	0f000000
س	1	00000000
س	2	000000f0
س	3	000000ff
ش	0	0f000000
ش	1	00000000
ش	2	000000f0
ش	3	000000ff
ص	0	00000000
ص	1	00000000
ص	2	000000f0
ص	3	000000f0
ض	0	00000000
ض	1	00000000
ض	2	000000f0
ض	3	000000f0
ط	0	00000000
ط	1	00000000
ط	2	000000f0
ط	3	000000f0
ظ	0	00000000
ظ	1	00000000
ظ	2	000000f0
ظ	3	000000f0
ع	0	0f000000
ع	1	000000f0
ع	2	0f0000f0
ع	3	000000f0
غ	0	0f000000
غ	1	000000f0
غ	2	0f0000f0
غ	3	000000f0
ڠ	0	0f000000
ڠ	1	000000f0
ڠ	2	0f0000f0
ڠ	3	000000f0
ف	0	00000000
ف	1	0f000000
ف	2	0f0000f0
ف	3	000000f0
ڤ	0	00000000
ڤ	1	0f000000
ڤ	2	0f0000f0
ڤ	3	000000f0
ق	0	00000000
ق	1	0f000000
ق	2	0f0000f0
ق	3	000000f0
ک	0	00000000
ک	1	ff000000
ک	2	ff000000
ک	3	00000000
ݢ	0	00000000
ݢ	1	ff000000
ݢ	2	ff000000
ݢ	3	00000000
ل	0	0f000000
ل	1	0000ffff
ل	2	00f0ffff
ل	3	000000ff
م	0	0f000000
م	1	0f000000
م	2	0f0000f0
م	3	000000f0
ن	0	00000000
ن	1	0f00f0ff
ن	2	0000ffff
ن	3	000000f0
و	0	ff000000
و	1	0f0000ff
ۏ	0	ff000000
ۏ	1	0f0000ff
ه	0	ff000000
ه	1	000000f0
ه	2	000000f0
ه	3	000000ff
ء	0	ff0000ff
ء	1	ff0000ff
ي	0	00000000
ي	1	0f0000ff
ي	2	0f00f0ff
ي	3	000000f0
ى	0	00000000
ى	1	0f0000ff
ى	2	0f00f0ff
ى	3	000000f0
ڽ	0	00000000
ڽ	1	0000f0ff
ڽ	2	0000ffff
ڽ	3	000000f0
لا	0	ff000000
لا	1	000000ff
ئ	0	00000000
ئ	1	0f0000ff
ئ	2	0f00f0ff
ئ	3	000000f0
ايکسترا	0	ffff0000
ايکسترا	1	ff0f0000
أ	0	ffff0f0e
أ	1	e0ffffff
إ	0	ffff0f00
إ	1	00ffffff
ـ	0	0f0000f0
،	0	0f0000ff
؛	0	0f0000ff
؟	0	0f000000
٢	0	ff000000
-	0	ff000000
رواڠ	0	00000000
رواڠ	1	ffffff0f''' ,
    '\n')

    سيمبول_لاءين = { # belum selesai
        0: 8,
        1: 8,
        2: 6,
        3: 6,
        4: 8,
        5: 7,
        6: 3,
        7: 8,
        8: 8,
        9: 8,
        10: 8,
        11: 8,
        12: 8,
        13: 8,
        14: 4,
        15: 4,
    }
    جک تيڤى(ح) == تيڤى(0):
        #چيتق(ح ,جدوال[ح - اکسارا_ڤرتام])
        جک ح - اکسارا_ڤرتام < 0:
            جک ح دالم سيمبول_لاءين:
                کمبالي سيمبول_لاءين[ح]
            لاءين: کمبالي 0
        #چيتق(ح ,جدوال[ح - اکسارا_ڤرتام])
        کمبالي 8 - ڤيسه(جدوال[ح - اکسارا_ڤرتام] ,'\t')[2].count('f')
    اونتوق د دالم جدوال:
        د = ڤيسه(د ,'\t')
        جک ح == د[0] دان ي == اينتيݢر(د[1]):
            کمبالي 8 - د[2].count('f')


فوڠسي کيرا(باريس):
    جواڤن = 0
    سدڠ_دالم = ڤلسو
    nilai_piksel = '!3(5)5,5-6.4 4"7\'306162636475666768796:5?7A6B6C7D6E6F6G7H6I5J7K7L7M6N6O7P6Q7R6S6T6U6V6W6X6Y6Z6a7b6c6d6e6f5g7h6i3j5k6l3m6n6o6p6q6r5s6t5u6v6w6x6y6z6é6'
    nilai_piksel = kamus(zip(nilai_piksel[::2], nilai_piksel[1::2]))
    اونتوق ي ,ک دالم مڠڠکاکن(باريس):
        جک ک == '{':
            سدڠ_دالم = بنر
            جک باريس[ي+1:ي+7] == 'symbol':
                جواڤن += کيرا_رواڠ(اينتيݢر(باريس[ي+8:ي+10] ,16))
            جکاءين باريس[ي+1:ي+7] == 'player':
                جواڤن += ڤنجڠ_نام
            جکاءين باريس[ي+1:ي+4] == 'key':
                جواڤن += 16  # semua "{key:___}" memang tepat 16 piksel
        جکاءين سدڠ_دالم دان ک == '}':
            سدڠ_دالم = ڤلسو
        جکاءين بوکن سدڠ_دالم:
            جواڤن += اينتيݢر(nilai_piksel[ک])
    کمبالي جواڤن

tukar = توکر
dapat_id = داڤت_اي_دي
kira_ruang = کيرا_رواڠ
kira = کيرا








#
