# jawipython مانديلبروت.ms.py | ffmpeg -y -f rawvideo -vcodec rawvideo -s 640x720 -pix_fmt rgba -i - ./out3.png

import sys

فوڠسي اءوتڤوت_باءيت(نومبور):
    sys.stdout.buffer.write(bait([نومبور]))


''' # اءوتڤوت ڤڤريقساءن
اونتوق ا دالم جولت(720):
    اونتوق ب دالم جولت(640):
        اءوتڤوت_باءيت(ا % 256)
        اءوتڤوت_باءيت(ب % 256)
        اءوتڤوت_باءيت(0)
        اءوتڤوت_باءيت(255)
'''
ماقس = 2
چ = 0.0 + 1.0j


فوڠسي ف(ذ):
    کمبالي ذ ** 2 + چ

اونتوق ا دالم جولت(720):
    اونتوق ب دالم جولت(640):
        ايخس ,واي = (ا - 360)/180 ,(ب - 320)/180
        نيلاي = ايخس + واي * 1j
        اونتوق _ دالم جولت(10):
            جک abs(نيلاي)  < 255:
                نيلاي = ف(نيلاي)

        جک abs(نيلاي) < ماقس:
            کچرهن = اينتيݢر(abs(نيلاي) * 255/ماقس)
            اءوتڤوت_باءيت(کچرهن)
            اءوتڤوت_باءيت(کچرهن)
            اءوتڤوت_باءيت(کچرهن)
            اءوتڤوت_باءيت(255)
        لاءين:
            اءوتڤوت_باءيت(0)
            اءوتڤوت_باءيت(0)
            اءوتڤوت_باءيت(مينيموم(255 ,اينتيݢر(abs(نيلاي))))
            اءوتڤوت_باءيت(255)











#
