# jawipython مانديلبروت.ms.py | ffmpeg -y -f rawvideo -vcodec rawvideo -s 640x720 -pix_fmt rgba -i - ./out1.png

import sys

فوڠسي اءوتڤوت_باءيت(نومبور):
    sys.stdout.buffer.write(bait([نومبور]))


                                        فوڠسي ف(ذ):
                                            کمبالي ذ ** 2 + چ

                                        اونتوق ا دالم جولت(720):
                                            اونتوق ب دالم جولت(640):
                                                ايخس = (ا - 360) / 240
                                                واي = (ب - 480) / 240
                                                چ = واي + ايخس * 1j
                                                نيلاي = چ
                                                اونتوق ي دالم جولت(20):
                                                    جک مطلق(نيلاي) < 3.0:
                                                        نيلاي = ف(نيلاي)
                                                    لاءين: ڤوتوس

                                                جک مطلق(نيلاي) < 3.0:
                                                    کچرهن = 0
                                                    اءوتڤوت_باءيت(کچرهن) # ميره
                                                    اءوتڤوت_باءيت(کچرهن) # هيجاو
                                                    اءوتڤوت_باءيت(کچرهن) # بيرو
                                                    اءوتڤوت_باءيت(255)   # الفا
                                                لاءين:
                                                    کچرهن = مينيموم(255 ,ي * 15)
                                                    اءوتڤوت_باءيت(0)     # ميره
                                                    اءوتڤوت_باءيت(کچرهن) # هيجاو
                                                    اءوتڤوت_باءيت(کچرهن) # بيرو
                                                    اءوتڤوت_باءيت(255)   # الفا











#
